# ProductOriginalEquipmentManufacture Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ProductOriginalEquipmentManufacture Property
FabricationPart Class See Also
---
The product original equipment manufacture (OEM) of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ProductOriginalEquipmentManufacture { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProductOriginalEquipmentManufacture As String
	Get
```

Visual C++
---
```text
public:
property String^ ProductOriginalEquipmentManufacture {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace